098_Мастер_Ра_разработка/src/Documents/Инвентаризация/Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвентаризация</name>
  <registerRecords>AccumulationRegister.Материалы</registerRecords>
  <registerRecords>AccumulationRegister.Рулоны</registerRecords>
  <attributes>
    <name>ВизаНП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВизыНП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВизаУУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВизыУУ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МатериалОсновы</name>
      <type>
        <types>CatalogRef.МатериалОсновы</types>
      </type>
    </attributes>
    <attributes>
      <name>Рулон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/AccumulationRegisters/Рулоны/Рулоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Рулоны</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Рулон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МатериалОсновы</name>
    <type>
      <types>CatalogRef.МатериалОсновы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

098_Мастер_Ра_разработка/src/InformationRegisters/ЦеныРулонов/ЦеныРулонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныРулонов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Рулон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

098_Мастер_Ра_разработка/src/Documents/Инвентаризация/Forms/ФормаДокумента/Module.bsl
// @strict-types


&НаКлиенте
Процедура Заполнить(Команда)
   ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РулоныОстатки.Материал,
		|	РулоныОстатки.Рулон,
		|	РулоныОстатки.КоличествоОстаток КАК ОстатокПоДокументу,
		|	РулоныОстатки.Материал.Поставщик КАК Поставщик,
		|	РулоныОстатки.Материал.Ширина КАК Ширина,
		|	ЦеныРулоновСрезПоследних.Цена,
		|	РулоныОстатки.МатериалОсновы КАК МатериалОсновы
		|ИЗ
		|	РегистрНакопления.Рулоны.Остатки(&НаДату, ) КАК РулоныОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныРулонов.СрезПоследних КАК ЦеныРулоновСрезПоследних
		|		ПО РулоныОстатки.Рулон = ЦеныРулоновСрезПоследних.Рулон";

	Запрос.УстановитьПараметр("НаДату",Объект.Дата);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    Объект.Материалы.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры	

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	текщиеДанные = Элементы.Материалы.ТекущиеДанные;
	текщиеДанные.разница = текщиеДанные.ОстатокПоДокументу-текщиеДанные.ОстатокФакт; 
КонецПроцедуры

&НаКлиенте
Процедура ВизаНППриИзменении(Элемент)
	ЗаполнитьДатуВизыНП();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатуВизыНП()
  	Объект.ДатаВизыНП = ТекущаяДата();
	Элементы.ВизаНП.Доступность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не РольДоступна("Полныеправа")Тогда 
		Элементы.ВизаНП.Доступность = Не ЗначениеЗаполнено(Объект.ДатаВизыНП);
		Элементы.ВизаУУ.Доступность = Не ЗначениеЗаполнено(Объект.ДатаВизыУУ);
		Если  Объект.ВизаУУ и Объект.ВизаНП Тогда 
			ЭтаФорма.ТолькоПросмотр =  Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВизаУУПриИзменении(Элемент)
	ЗаполнитьДатуВизыУУ();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатуВизыУУ()
  	Объект.ДатаВизыУУ = ТекущаяДата();
	Элементы.ВизаУУ.Доступность = Ложь;
КонецПроцедуры
